ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0l111x/KEYSTORECTL_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="KEYSTORECTL" HW_revision="1.0">
    <register id="KEYSTORECTL_CFG" width="32" offset="0x1100" description="Keystore configuration">
        <bitfield id="NK256" description="Number of 256 bit keys to be held in the key-store.
Can not exceed the total number of slots present in the hardware / 2.
For eg: if SYS_N_SLOTS = 4, then atmost 2 256-bit keys can be held in the key-store.
Incorrect setting of this field will be reported via STATUS register" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="No 256-bit keys"/>
            <bitenum id="ONE" value="0x1" description="One 256-bit key"/>
            <bitenum id="TWO" value="0x2" description="Two 256-bit keys"/>
            <bitenum id="THREE" value="0x3" description="Three 256-bit keys"/>
            <bitenum id="FOUR" value="0x4" description="Four 256-bit keys"/>
        </bitfield>
    </register>
    <register id="KEYSTORECTL_KEYWR" width="32" offset="0x1104" description="Key write configuration">
        <bitfield id="KEYSZSEL" description="Key size selection. Selection of 128 or 256 bit keys" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="K256" value="0x0" description="256 bit key"/>
            <bitenum id="K128" value="0x1" description="128 bit key"/>
        </bitfield>
        <bitfield id="KEYSLOTSEL" description="Select the key slot to write the key into.
NOTE: SW needs to ensure that it is writing to the correct slots. The slot numbering is from 0 through SYS_N_SLOTS-1.
Each slot is a 128-bit slot. Therefore, when writing a 256-bit key, two slots will need to budgeted.
The selected slot for the 256-bit key needs to be an even numbered slot (eg: 0 or 2). 
Also all the 256-bit keys need to be stored in lower numbered slots and 128-bit keys stored in higher numbered slots." begin="7" end="4" width="4" rwaccess="R/W">
            <bitenum id="SLOT0" value="0x0" description="Slot 0"/>
            <bitenum id="SLOT1" value="0x1" description="Slot 1"/>
            <bitenum id="SLOT2" value="0x2" description="Slot 2"/>
            <bitenum id="SLOT3" value="0x3" description="Slot 3"/>
            <bitenum id="SLOT4" value="0x4" description="Slot 4"/>
            <bitenum id="SLOT5" value="0x5" description="Slot 5"/>
            <bitenum id="SLOT6" value="0x6" description="Slot 6"/>
            <bitenum id="SLOT7" value="0x7" description="Slot 7"/>
        </bitfield>
    </register>
    <register id="KEYSTORECTL_KEYRD" width="32" offset="0x1108" description="Key read configuration">
        <bitfield id="KEYSZSEL" description="Key size selection. Selection of 128 or 256 bit keys" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="K256" value="0x0" description="256 bit key"/>
            <bitenum id="K128" value="0x1" description="128 bit key"/>
        </bitfield>
        <bitfield id="KEYSLOTSEL" description="Select the key slot to read the key from.
NOTE: SW needs to ensure that it is reading from the correct slots. The slot numbering is from 0 through SYS_N_SLOTS-1.
Each slot is a 128-bit slot. Therefore, when reading a 256-bit key, two adjacent slots will be read.
For a 256-bit key, an even numbered slot index must be specified." begin="7" end="4" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="CRYPTOSEL" description="Crypto engine selector" begin="9" end="8" width="2" rwaccess="R/W">
            <bitenum id="AES" value="0x0" description="Transfer key to AES"/>
        </bitfield>
    </register>
    <register id="KEYSTORECTL_STATUS" width="32" offset="0x110C" description="Status">
        <bitfield id="STAT" description="Status information" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="VALID" value="0x0" description="Valid configuration"/>
            <bitenum id="NO_CFG" value="0x1" description="Key-store has not been configured. NK256 has not been set."/>
            <bitenum id="INVALID_NK256" value="0x2" description="Invalid value for NK256 field in CFG."/>
            <bitenum id="BUSY_RECEIVE" value="0x3" description="Busy receiving a key deposit"/>
            <bitenum id="BUSY_TRANSMIT" value="0x4" description="Busy transmitting a key to a crypto engine"/>
            <bitenum id="INVALID_KEYSLOTSELW" value="0x5" description="Invalid keyslot selection for writing"/>
            <bitenum id="INVALID_KEYSLOTSELR" value="0x6" description="Invalid keyslot selection for reading"/>
        </bitfield>
        <bitfield id="VALID" description="Bitvector of valid bits to indicate which slots have been configured" begin="11" end="4" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="NKEYSLOTS" description="Size of keystorage: Number of 128-bit key slots" begin="17" end="16" width="2" rwaccess="R">
            <bitenum id="TWO" value="0x0" description="Two slots"/>
            <bitenum id="THREE" value="0x1" description="Three slots"/>
            <bitenum id="FOUR" value="0x2" description="Four slots"/>
        </bitfield>
    </register>
    <register id="KEYSTORECTL_KEYIN" width="32" offset="0x1110" description="Input key">
    </register>
    <register id="KEYSTORECTL_KEYLOCK" width="32" offset="0x1114" description="Keylock">
        <bitfield id="LOCKBIT" description="Bitvector of lock bits to lock certain slots from being used by application." begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>

</module>